src/1c/src/Enums/СтатусыКурьерскихЗаявок/СтатусыКурьерскихЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКурьерскихЗаявок</name>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>ЖдетНазначенияКурьера</name>
  </enumValues>
  <enumValues>
    <name>УКурьера</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/1c/src/Documents/КурьерскаяЗаявка/КурьерскаяЗаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КурьерскаяЗаявка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/1c/src/CommonModules/КурьеркиеЗаявки/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Создать новую заявку.
//
// Параметры:
//  ПараметрыСоздания - см. КурьеркиеЗаявки.НовыйДанныеСозданияЗаявки
//
// Возвращаемое значение:
//	ДокументСсылка.КурьерскаяЗаявка
Функция СоздатьНовуюКурьерскуюЗаявку(ПараметрыСоздания) Экспорт

	НачатьТранзакцию();
	Попытка
		НоваяЗаявка = Документы.КурьерскаяЗаявка.СоздатьДокумент();
		НоваяЗаявка.Дата = ТекущаяДатаСеанса();
		НоваяЗаявка.Автор = ПараметрыСоздания.Автор;
		НоваяЗаявка.Адрес = ПараметрыСоздания.Адрес;
		НоваяЗаявка.Комментарий = ПараметрыСоздания.Комментарий;
		НоваяЗаявка.ДополнительныеСвойства.Вставить("Статус", Перечисления.СтатусыКурьерскихЗаявок.Создана);

		Если Не НоваяЗаявка.ПроверитьЗаполнение() Тогда
			ВызватьИсключение "Проверка заполнения выполнена с замечаниями.";
		КонецЕсли;
		НоваяЗаявка.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат НоваяЗаявка.Ссылка;

КонецФункции

// Новый данные создания заявки.
//
// Возвращаемое значение:
//  Структура - Новый данные создания курьерской заявки:
// * Автор - СправочникСсылка.Клиенты -
// * Адрес - Строка -
// * Комментарий - Строка -
Функция НовыйДанныеСозданияЗаявки() Экспорт
	Результат = Новый Структура();
	Результат.Вставить("Автор", Справочники.Клиенты.ПустаяСсылка());
	Результат.Вставить("Адрес", "");
	Результат.Вставить("Комментарий", "");
	Возврат Результат;
КонецФункции

#КонецОбласти
